#-------------------------------------------------------------------------------------------------------------------------
# Ключи для правильного счисления:
# (например существительных час, рубаха, пальто)
# one: 1, 101, 100501 и т.д. (час, рубаха, пальто)
# few: 2,3,4, 22, 23, 24, ... 134 и т.п. (часа, рубахи, пальто)
# many: 0, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, ... 25..30 и т.д. (часов, рубах, пальто)
# other: 
{:ru =>
	{ :i18n =>
		{ :plural =>
			{ :keys => [:one, :few, :many],
				:rule => lambda { |n|
					if n == 1
						:one
					else
						if n % 10 == 1 && n % 100 != 11
							:one
						elsif (2..4).include?(n % 10) && !(12..14).include?(n % 100)
							:few
						elsif n % 10 == 0 || (5..9).include?(n % 10) || (11..14).include?(n % 100)
							:many
						else
							:other
						end
					end
				}
			}
		}
	}
}
